packages/inductiva/inductiva-0.2.2-py3-none-any.whl/inductiva/templates/heat_sink/openfoam/files/constant/heater/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/heater";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/parameters"

internalField   $heaterPower; // Set power (W)

options
{
    energySource
    {
        type            semiImplicitSource;
        active          yes;
        selectionMode   all;

        volumeMode      absolute;

        sources
        {
            e
            {
                explicit    $internalField;
                implicit    0;
            }
        }
    }
}

// ************************************************************************* //
